/*
Логические : && и || ! 
Сравнение  < > >= <=  =! === ! ==! ===
* написать программу "светофор": программа запрашивает у пользователя цвет в текстовом виде, и печатает в консоль действие согласно ПДД. Например: красный : стой! желтый : жди и т.д.
(Реализовать в двух вариантах: через if..else и switch..case)
* Написать программу которая запрашивает число у пользователя и выводит название планеты солнечной системы по порядковому номеру. Например: 1 -> Меркурий, 3 -> Земля, 9 -> Плутон. Очередность планет если точно не знаете, то гуглите) (Реализовать в двух вариантах: через if..else и switch..case)
* Написать программу которая спрашивает у пользователя 2 числа и выводит какое из них больше. Если числа равны, вывести "числа равны"
* Написать тернарный оператор который выводит согласен ли пользователь на обработку персональных данных или нет.
* Написать тернарный оператор который выводит какое лицо перед нами. 1- Физическое, 2 - Юридическое
 */
// let Color = prompt("Напишите цвет ");
// // Вариант 1: if..else
// if (Color === "зеленный") {
//     alert("Светофор горит зеленым");
// } else if (Color === "Красный Стой! ") {
//     alert("Светофор горит красным");
// } else if (Color === "Желтый") {
//     alert("Светофор горит желтым");
// } else  if (Color === " "){
//     alert("Вы не ввели цвет");
// }

// 2 вариант swit case
// let color = prompt("Напишите цвет")
// switch (color) {
//     case "зеленный":
//         alert("Светофор горит зеленым");
//         break;
//     case "Красный Стой! ":
//         alert("Светофор горит красным");
//         break;
//     case "Желтый":
//         alert("Светофор горит желтым");
//         break;
//     default:
//         alert("Вы не ввели цвет");
// }

// 2 задание
// let number = prompt("Введите номер  ");
// if (number = 1) {
//     alert(" Меркурий");
// } else if (number = 2) {
//     alert("Венера");
// } else if (number = 3) {
//     alert("Земля");
// } else if (number = 4) {
//     alert("Марс");
// } else if (number = 5) {
//     alert("Юпитер");
// } else if (number = 6) {
//     alert("Сатурн");
// } else if (number = 7) {
//     alert("Уран");
// } else if (number = 8) {
//     alert("Нептун");
// } else if (number = 9) {
//     alert("Плутон");
// }
// 2.2
// let number = prompt("Введите номер от 1 до 9 для выбора планеты");
// number = Number(number);
// switch (number) {
//     case 1:
//         alert(" Меркурий");
//         break;
//     case 2:
//         alert("Венера");
//         break;
//     case 3:
//         alert("Земля");
//         break;
//     case 4:
//         alert("Марс");
//         break;
//     case 5:
//         alert("Юпитер");
//         break;
//     case 6:
//         alert("Сатурн");
//         break;
//     case 7:
//         alert("Уран");
//         break;
//     case 8:
//         alert("Нептун");
//         break;
//     case 9:
//         alert("Плутон");
//         break;
//     default:
//         alert("Вы ввели неправильный номер");
// }

// 3 задание
// let number1 = prompt("Введите первое число");
// let number2 = prompt("Введите второе число");
// number1 = Number(number1);
// number2 = Number(number2);
// if (number1 === number2) {
//     alert("Числа равны");
// } else if (number1 > number2) {
//     alert("Первое число больше второго");
// } else if (number1 < number2) {
//     alert("Первое число меньше второго");
// }

// let number1 = prompt("Введите первое число");
// let number2 = prompt("Введите второе число");
// number1 = Number(number1);
// number2 = Number(number2);
// switch (number1 >= number2 || number1<= number2) {
//     case true:
//         alert("Первое число больше второго");
//         break;
//     case false:
//         alert("Первое число меньше второго");
//         break;
//     default:
//         alert("Числа равны");
// } не лучший варинат


// // 4 * Написать тернарный оператор который выводит согласен ли пользователь на обработку персональных данных или нет.
// let numberAuthor = number;
// let isAuthor = numberAuthor % 2 === 0? "Да, я физическое лицо" : "Нет, я юридическое лицо";

// let isAuthor = numberAuthor % 2 === 0? "Да,согласно" : "Нет, не согласен";

// let isAuthor;

// if (numberAuthor % 2 === 0) {
//     isAuthor = "Да, я физическое лицо";
// } else {
//     isAuthor = "Нет, я юридическое лицо";
// }


