// Напишите программу, где пользователь вводит любое целое положительное число. А программа суммирует все числа от 1 до введенного пользователем числа. Например: 5 -> 15 (потому что 1 + 2 + 3 + 4 + 5 = 15), 10 -> 55.
// * запросить у пользователя число от 2 до 10 и с помощью цикла вывести таблицу умножения для этого числа в таком виде(я выбрал 4 для примера):
// 4 × 1 = 4
// 4 × 2 = 8
// 4 × 3 = 12
// ....
// 4 × 10 = 40
// * Написать функцию переворота строки. СТАНДАРТНУЮ ФУНКЦИЮ REVERSE НЕ ИСПОЛЬЗОВАТЬ. Например: myReverse("123456789") -> "987654321"
// * Написать функцию которая проверит является ли строка палиндромом. Палиндром - это строка которая читается справа налево также, как и справа налево. Например: потоп, спел лепс, топот, доход и т.д. Функция должна возвращать true\false. Например: checkPalindrome("потоп") -> true, checkPalindrome("привет") -> false.
// Подсказка: можно воспользоваться моей функцией по перевороту строки из урока, а можно своей из 3 задания.

// Напишите программу, где пользователь вводит любое целое положительное число. А программа суммирует все числа от 1 до введенного пользователем числа. Например: 5 -> 15 (потому что 1 + 2 + 3 + 4 + 5 = 15), 10 -> 55.
// const input = prompt('Введите любое целое положительное число');
// const number = parseInt(input);

// function sumNumber() {
//     let sum = 0;
//     for (let i = 1; i <= number; i++) {
//         sum += i;
//     }
//     return sum;
// }
// alert(sumNumber());
// const number = prompt("Введите число с 2 до 10");
// for (let i = 2; i <= 10; i++) {
//     console.table(number + " " + i + " = " + number * i);
// }

// Написать функцию переворота строки. СТАНДАРТНУЮ ФУНКЦИЮ REVERSE НЕ ИСПОЛЬЗОВАТЬ. Например: myReverse("123456789") -> "987654321"
// let Reverse = "myReverse";

// function reverseString(str) {
//     let reversed = "";
//     for (let i = str.length - 1; i >= 0; i--) {
//         reversed += str[i];
//     }
//     return reversed;
// }

// console.log(reverseString(myReverse));

// let Reverse = "myReverse";
// function reverseString(str) {
//     let reversed = "";
//     for (i = str.length - 1; i >= 0; i--) {
//         reversed = Reverse.join(str[i]);
//     }

// }

// console.log(reversed);
